niciwalter99/smart-fuel/Software/Puk/nRF5_SDK_17.1.0_ddde560/examples/ble_peripheral/smart_fuel/main.c
       case BLE_GATTS_EVT_HVN_TX_COMPLETE:
            tx_success++;
            if(tx_success > 3){
              tx_success = 0;
              send_data();
              }
            break;


        default:
            // No implementation needed.
            break;
    }
}


/**@brief Function for initializing the BLE stack.
 *
 * @details Initializes the SoftDevice and the BLE event interrupt.
 */
static void ble_stack_init(void)
{
    ret_code_t err_code;

    err_code = nrf_sdh_enable_request();
    APP_ERROR_CHECK(err_code);

     //Configure the BLE stack using the default settings.
     //Fetch the start address of the application RAM.
    uint32_t ram_start = 0;
    err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
    APP_ERROR_CHECK(err_code);

    // Enable BLE stack.
    err_code = nrf_sdh_ble_enable(&ram_start);
    APP_ERROR_CHECK(err_code);

    // Register a handler for BLE events.
    NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for handling events from the button handler module.
 *
 * @param[in] pin_no        The pin that the event applies to.
 * @param[in] button_action The button action (press/release).
 */
static void button_event_handler(uint8_t pin_no, uint8_t button_action)
{
    ret_code_t err_code;

    switch (pin_no)
    {
        case LEDBUTTON_BUTTON:
            NRF_LOG_INFO("Send button state change.");
            err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, 55);
            if (err_code != NRF_SUCCESS &&
                err_code != BLE_ERROR_INVALID_CONN_HANDLE &&
                err_code != NRF_ERROR_INVALID_STATE &&
                err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
            {
                APP_ERROR_CHECK(err_code);
            }
            break;

        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}


/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

static void lfclk_config(void)
{
    ret_code_t err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);

    nrf_drv_clock_lfclk_request(NULL);
}

static void rtc_handler(nrf_drv_rtc_int_type_t int_type)
{
    hx711_start(true);
    nrf_drv_rtc_counter_clear(&rtc);
    nrf_drv_rtc_cc_set(&rtc,0,1 * 8,true);

}

/** @brief Function initialization and configuration of RTC driver instance.
 */
static void rtc_config(void)
{
    uint32_t err_code;

    //Initialize RTC instance
    nrf_drv_rtc_config_t config = NRF_DRV_RTC_DEFAULT_CONFIG;
    config.prescaler = 4095;
    err_code = nrf_drv_rtc_init(&rtc, &config, rtc_handler);
    NRF_LOG_ERROR(err_code);
    //APP_ERROR_CHECK(err_code);

    ////Enable tick event & interrupt
    ////nrf_drv_rtc_tick_enable(&rtc,true);

    ////Set compare channel to trigger interrupt after COMPARE_COUNTERTIME seconds
    err_code = nrf_drv_rtc_cc_set(&rtc,0,1 * 8,true);
    APP_ERROR_CHECK(err_code);

    ////Power on RTC instance
    nrf_drv_rtc_enable(&rtc);
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

static bool hx711_offset_set = false;
static uint32_t hx711_offset = 0;

void hx711_callback(hx711_evt_t evt, int value)
{
    uint16_t length = sizeof(int);

    //if(connected) {
    //uint32_t        err_code;

    // err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, 44);
    // if (err_code != NRF_SUCCESS) 
    //    {
    //        NRF_LOG_ERROR("FAIL SEND");
    //    }
    //     nrf_delay_ms(200);
    // err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, 45);
    //  if (err_code != NRF_SUCCESS) 
    //    {
    //        NRF_LOG_ERROR("FAIL SEND");
    //    }
    // nrf_delay_ms(200);
    // err_code = ble_lbs_on_button_change(m_conn_handle, &m_lbs, 46);
    //  if (err_code != NRF_SUCCESS) 
    //    {
    //        NRF_LOG_ERROR("FAIL SEND");
    //    }
    //   }
    //    nrf_delay_ms(200);
    
    if(evt == DATA_READY)
    {
        /* Transmit received sensor data over BLE - ignoring return value. Packets will be dropped
         if:
         -  Not connected
         -  Client has not enabled Notification on the TX characteristic
         -  TX buffer is full*/
        if(!hx711_offset_set) {
          hx711_offset_set = true;
          hx711_offset = value;

        } else{
          int value_with_offset = (value - hx711_offset);
          uint32_t weigth = 0;
          if (value_with_offset > 0) {
            weigth = value_with_offset / 216;
          } 
          //ble_lbs_on_button_change(m_conn_handle, &m_lbs, weigth);
          //get_data_information(m_conn_handle, &m_lbs);
          NRF_LOG_INFO("ADC measuremement %d", weigth);
        }
    }
    else
    {
        /*Invalid ADC readout. A non-zero value would indicate that the readout was interrupted 
         by a higher priority interrupt during readout (i.e., Softdevice radio event).
         */
        NRF_LOG_INFO("ADC readout error. %d 0x%x", value, value);
    }
}

static void send_Data() {
     ble_lbs_on_button_change(m_conn_handle, &m_lbs, 44);
     ble_lbs_on_button_change(m_conn_handle, &m_lbs, 45);
     ble_lbs_on_button_change(m_conn_handle, &m_lbs, 46);
     dataSend = true;

}


/**@brief Function for application main entry.
 */
int main(void)
{
    // Initialize.
    hx711_init(INPUT_CH_A_128, hx711_callback);
    log_init();
    leds_init();
    timers_init();
    NRF_LOG_INFO("Blinky example started.");

    lfclk_config();
    rtc_config();
    NRF_LOG_INFO("Blinky example started.");

    ble_stack_init();
    NRF_LOG_INFO("Init Storage");
    //storage_init();
    //NRF_LOG_INFO("write boot count");
    //write_boot_count();
    //NRF_LOG_INFO("get boot ocunt");
    //uint8_t boot_count[4000];
    //uint8_t *p = get_boot_count(boot_count);
    //NRF_LOG_INFO("Get Boot Count %d", p[0]);
    //NRF_LOG_INFO("Get Boot Count %d", p[1]);

    power_management_init();
    buttons_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
  
    // Start execution.
    NRF_LOG_INFO("Blinky example started.");
    //NRF_LOG_PROCESS();
    advertising_start();

    // Enter main loop.
    for (;;)
    {
       idle_state_handle();
    }
}


/**
 * @}
 */
